{"Jim Adkisson": {"The Adkisson Manifesto": "To Whom It May Concern I guess you are wondering why I committed this patriotic act against the Unitarian Universalist Church in Knoxville, Tennessee. Let me explain it in detail here. Over the years I have had some good jobs, but I always got laid off. I am now 58 years old and cannot find a decent job. They tell me I am 'overqualified,' which is a code term for 'too damned old.' I guess they just expect me to age gracefully into poverty. No thank you! My life is done. I have always wondered why I was put on this Earth. For years, I thought it was so I could die as cannon fodder in Viet-Nam, but I somehow cheated the devil out of that plan. Lately, I have been feeling helpless about our War on Terrorism, but I finally realized that I could engage the terrorist's allies here in America. These are the best allies they have. The Democrats! The Democrats have done everything they can to tie our hands in this War on Terror. They are all a bunch of traitors. They want America to lose this war and for reasons I cannot understand. It makes me so exceedingly angry! In a parallel train of thought, it saddens me to think back on all the bad things that liberalism has done to this country. The worst problem America faces today is liberalism. The liberals have dumbed down education and redefined deviancy as a virtue. Liberals have attacked every major institution that has made America great. The scope of these attacks has ranged from the Boy Scouts of America to the U.S. military and from education to religion. The major news outlets have become the propaganda arm of the Democrat Party. Liberals are evil. They embrace the tenets of Karl Marx. They are Marxist, socialist, and communist. The Unitarian Universalist Church Do not let the word 'church' mislead you. The Unitarian Universalist Church is not a church. It is a cult. They do not even believe in God. They worship the god of secularism. These sick people are not just liberals. They are ultra-liberals. This is a collection of sick, weird, and homosexual people. The Unitarian Universalist Church is the fountainhead, the veritable wellspring, of anti-American organizations like Moveon.org, and Code Pink. Their people are absolute hypocrites. They embrace every pervert that comes down the pike, but if they discover you are a conservative, they absolutely hate you. I have experienced this first hand in my own life. I cannot, for the life of me, understand why these people would embrace Marxism as they do. I believe someone should do a journalistic exposé on this church because it is a den of unAmerican vipers. They call themselves 'progressive.' How is a white woman having a nigger baby progress? How is a man sticking his dick up another man's ass progress? It is an abomination before the Lord. It takes warped minds to hate America like they do. It makes me so angry! I cannot live with it anymore! The environmental nuts have to be stopped too! Know This if Nothing Else I. This Was a Hate Crime: I hate the damned left-wing liberals. There is a vast left-wing conspiracy in this country, and these liberals are working together to attack every decent and honorable institution in our nation. They are trying to turn this country into a communist state. Shame on them. II. This Was a Political Protest: I am protesting the liberal U.S. Supreme Court justices for giving constitutional rights to the terrorists at Gitmo. I am protesting the major news outlets (ABC, NBC, CBS, CNN, and PBS) for being the propaganda wing of the Democrat Party. The things they are getting away with are criminal. They are traitors! They must be stopped. I am protesting against the Democratic National Convention for running a radical, leftist candidate for President of the United States, namely Osama Hussein Obama (Yo Mama!!!). He has no experience. He has no brains. He is a joke. He is dangerous to America. Hell! He even looks like Curious George! III. This Was a Symbolic Killing: I wanted to kill every Democrat in the U.S. Senate, every Democrat in the U.S. House of Representatives, and all 100 people in Bernard Goldberg's book entitled 100 People Who Are Screwing Up America. I would like to kill everyone in the mainstream news media. Nonetheless, I knew these people were inaccessible to me. I could not get to the generals and high-ranking officers of the Marxist movement, so I went after the foot soldiers, the chicken shit liberals who vote these traitorous people into office. Someone had to get the ball rolling. I volunteered. I hope others will do the same. It is the only way we can rid America of this cancer and pestilence called liberalism! In Conclusion No one gets out of this world alive, so I have chosen to skip my oncoming bad years of poverty. I know my life is going downhill fast from here. The future looks bleak. I am just sick and tired of being sick and tired. I am absolutely fed up. So, I decided to do something good for this country. Kill Democrats until the cops kill me. If each decent and patriotic American could vote three times in every election, we still could not stem this tide of liberalism that is destroying America. Liberals are a pest like termites. There are millions of them. Each little bite they take contributes to the downfall of this great nation. The only way we can rid ourselves of this evil is to kill them in the streets. Kill them where they gather! I would like to encourage other like-minded people to do as I have done. If life is no longer worth living, do not just kill yourself. Do something worthwhile for your country before you go. Kill liberals. Tell this to the cop who killed me, 'Thanks, I needed that!' I have no next of kin and no living relatives. If you would like to do so, please take my sorry carcass to the The Body Farm at the University of Tennessee in Knoxville, donate it to science, or just throw it in the Tennessee River."}}
